{
    "name": "Steerable",
    "id": "steerable",
    "author": "Luminists (Chih-Kang & Jui-Ting)",
    "version": "1.0.0",
    "long_description": "This brush demonstrates an application of quantum control theory.\nThe user selects three regions—source, target, and paste—by drawing two or three circles.\nThe third region may also be specified as a single point (i.e., two circles and one point). In this case, the steered source image will be pasted into the region whose barycenter corresponds to the selected point.\nBy default, \"Source = Paste\" is false; please select it only if you do not define a separate third region.\n\nA model is then trained to compute a quantum circuit that transforms the source region into the target region.\nAfter training, the learned transformation is applied to the paste region (which may be identical to the source).\n\nThe user can also choose a parameter, t, which controls how far along the transformation the system evolves:\nt = 0 → fully similar to the source\nt = 1 → fully similar to the target\nt > 1 → evolves beyond the target state, which may produce interesting effects\n\nAdditional parameters:\ntimestep: the number of discrete time steps used to approximate the circuit’s evolution\ncontrols: the number of features used to represent a patch, corresponding to the number of qubits\n\nThe user also has optional visualization controls: enable \"show source & target\" and optionally \"show color\" to display the reference regions.\n",
    "description": "Steerable uses quantum control theory to drive a source image region towards a target region and paste into a third region. \n\nThe quality of the effect is controlled by several parameters:\n 🔹 t → time parameter for the evolution of the system\n 🔹 timestep → the number of discrete time steps used to approximate the circuit’s evolution\n 🔹 controls → the number of features used to represent a patch, corresponding to the number of qubits\n 🔹  \"Source = Paste\" → whether to make the source region equal to the paste region\n\n Usage:\n 🔸 Click and drag on the canvas to select the copy region.\n 🔸 Click and drag to select the position of the targer region.\n 🔸 Either click or click and drag to select a paste region. \n\n \n\n The user also has optional visualization controls: enable \"show source & target\" and optionally \"show color\" to display the reference regions.\n",
    "dependencies": {
        "numpy": ">=2.1.0",
        "qiskit": "",
        "jax": "",
        "pennylane": ""
    },
    "user_input": {
        "Controls": {
            "type": "int",
            "min": 2,
            "max": 4,
            "default": 2
        },
        "timesteps": {
            "type": "int",
            "min": 10,
            "max": 100,
            "default": 25
        },
        "t": {
            "type": "float",
            "min": 0.0,
            "max": 1.5,
            "default": 0.8
        },
        "Souce=Paste": {
            "type": "bool",
            "default": true
        },
        "show source & target": {
            "type": "bool",
            "default": false
        },
        "show color": {
            "type": "color",
            "default": "#FF0000"
        }
    },
    "stroke_input": {
        "image_rgba": "array",
        "clicks": "array",
        "path": "array"
    },
    "flags": {}
}
